code/D7/system/probes_fistula
probes_fistula
{
    type            probes;
    libs            (sampling);

    // Name of the directory for probe data
    name            probes;

    // Write at same frequency as fields
    writeControl    outputTime;
    writeInterval   1;
    setFormat raw;
    surfaceFormat raw;

    // Fields to be probed
    fields          (U "p.*");

    // Optional: do not recalculate cells if mesh moves
    // Only cell interpolation can be applied when not using fixedLocations. 
    // InterpolationScheme entry will be ignored
    fixedLocations  true;

    // Optional: interpolation scheme to use (default is cell)
    interpolationScheme cellPoint;

    probeLocations
    (
		(-0.0028986039161682	0.034958892822266004	0.0024107580184937)
		(-0.0028920948505402003	0.034863494873047005	0.0024200727939606)
		(-0.0028821501731873	0.034771881103516	0.0024465582370758)
		(-0.0028655471801758	0.034682960510254	0.0024789650440216)
		(-0.0028442113399506004	0.034599361419677996	0.0025205507278442)
		(-0.0028307762145996	0.034536144256592	0.0025910661220551)
		(-0.002829155921936	0.034486576080322004	0.0026732380390167)
		(-0.0028410007953644	0.034447383880615	0.0027600240707397)
		(-0.0028627357482910003	0.034425045013427996	0.0028507287502289)
		(-0.0028884403705597	0.03442068862915	0.0029431560039520003)
		(-0.002911167383194	0.034424785614014	0.0030364036560059)
		(-0.0029393939971924	0.034443775177002006	0.0031260433197021)
		(-0.0029749636650085003	0.034480724334717	0.0032072365283966)
		(-0.0030071928501129	0.034520000457764	0.0032888035774231)
		(-0.0030431089401245	0.034555072784424	0.0033706891536713)
		(-0.0030911228656769	0.034584922790527	0.0034483261108398)
		(-0.0031457772254944	0.034616249084473	0.0035208456516265998)
		(-0.0032028963565826	0.034656188964844	0.0035869824886322)
		(-0.0032612593173981003	0.03469690322876	0.0036515622138977005)
		(-0.0033158493041992	0.034742771148682	0.0037159836292267002)
		(-0.0033782529830933	0.03478625869751	0.0037746276855469)
		(-0.0034487392902374002	0.034828659057617006	0.0038241014480590997)
		(-0.0035295052528381003	0.034866943359375	0.0038591945171356002)
		(-0.0036137080192566	0.034904430389404	0.0038862762451172)
		(-0.0037008154392242	0.034940860748291	0.0039041464328766)
		(-0.0037866034507751	0.034978504180908	0.0039254443645477)
		(-0.0038704710006714003	0.035015716552734	0.0039540190696716005)
		(-0.003954386472702001	0.0350517578125	0.0039838347434998)
		(-0.0040401206016541	0.035075187683105004	0.004020176410675)
		(-0.0041295733451843005	0.035089416503906005	0.0040520982742309995)
		(-0.0042230377197266	0.035099517822266	0.004071713924408)
		(-0.004318480491638199	0.035105270385742	0.0040808501243591)
		(-0.0044143128395081	0.035112365722656004	0.0040804648399353)
		(-0.0045101370811462	0.035118549346924	0.0040834150314331)
		(-0.004605610370636	0.035120578765869	0.0040939960479736)
		(-0.004700891494751	0.035110679626465004	0.004094707012176501)
		(-0.0047903761863708	0.035082942962646003	0.004074060916900601)
		(-0.0048772268295288	0.035051586151123	0.0040474624633789)
		(-0.004963062286377	0.03502433013916	0.0040139741897583)
		(-0.0050505247116089	0.03500061416626	0.0039819777011871)
	);
	// Optional: filter out points that haven't been found. Default	is to include them (with value -VGREAT)
	includeOutOfBounds  true;
}
